export const recipes = [
  {
    id: 1,
    name: 'Пампушки',
    category: 'Обід',
    image: './image/pampushki-s.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 40 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '½ ч. л. солі', id: 4 },
      { ingredient: '1 ст. л. цукру', id: 3 },
      { ingredient: '10 г. сухих дріжджів', id: 1 },
      { ingredient: '450 г. пшеничного борошна', id: 0 },
      {
        ingredient:
          '100 г. розм’якшеного вершкового масла або соняшникової олії (+ для змащування форми)',
      },
      { ingredient: '250 мл. теплого молока', id: 2 },
      { ingredient: '3 зубчики часнику', id: 5 },
      { ingredient: '6 гілочок кропу', id: 6 },
      { ingredient: '2 ст. л. соняшникової олії', id: 7 },
      { ingredient: 'Сіль та перець до смаку', id: 8 },
    ],
    description: [
      {
        step: 'У великій мисці змішайте спочатку сухі інгредієнти для тіста: 450 г пшеничного борошна, 10 г сухих дріжджів, 1 ст. л. цукру і ½ ч. л. солі. Цукор всипайте в інший бік миски від дріжджів. Потім влийте 250 мл теплого молока, додайте 100 г розм’якшеного вершкового масла.',
      },
      {
        step: 'Замісіть еластичне тісто, воно не повинно прилипати до рук. Залиште його в теплому місці на 45 хвилин, накривши рушником або харчовою плівкою. Потім обімніть тісто і розділіть на 12 кульок, сформуйте пампушки. Розігрійте духовку до 180 ℃.',
      },
      {
        step: 'Акуратно розкладіть пампушки у форму, попередньо змащену вершковим маслом чи олією. Залиште пампушки у формі ще на 30 хвилин. Ми використовували прямокутну форму розміром приблизно 28х16 см, але можна взяти круглу чи будь-яку іншу, тут це не має великого значення.',
      },
      {
        step: 'Поставте форму з пампушками, що підійшли, у розігріту до 180 ℃ духовку випікатися на 25-30 хвилин.',
      },
      {
        step: 'Тим часом зробіть начинку. Очистити 3 зубчики часнику і дуже дрібно порубайте ножем. Викладіть у маленьку піалу. Помийте й обсушіть зелень 6 гілочок кропу і теж дрібно посічіть. З’єднайте з часником. Додайте 2 ст. л. соняшникової олії, 1 ст. л. оцту і сіль з перцем до смаку. Ретельно перемішайте.',
      },
      {
        step: 'Щедро полийте часниковою заправкою готові пампушки, поки ще гарячі, так вони краще наситяться ароматами.',
      },
    ],
  },
  {
    id: 2,
    name: 'Пончики',
    category: 'Десерт',
    image: './image/ponchyky.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г.30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '7/10',
      },
      {
        image: './icon/person.svg',
        info: '3 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '4 г. сухих дріжджів' },
      { ingredient: '6 г. солі' },
      { ingredient: '40 г. кефіру ' },
      { ingredient: '80 г. води' },
      { ingredient: '80 г. яєчних жовтків' },
      { ingredient: '30 г. цукру' },
      { ingredient: '50 г. вершкового масла' },
      { ingredient: '310 г. борошна' },
    ],
    description: [
      {
        step: 'У чаші міксера змішати кефір, воду, жовтки, борошно і дріжджі. Перемішати насадкою "гак" на низькій швидкості (3 хв.)',
      },
      {
        step: 'Додати сіль і цукор, перемішати ще 1 хвилину і додати нарізане кубиками холодне масло. Замішувати поки тісто не почне відлипати від стінок чаші (10-15 хвилин). Воно в результаті має бути гладким і блискучим.',
      },
      {
        step: 'Сформувати з тіста кулю, покласти в чисту чашу, накрити плівкою або рушником і залишити в теплому місці на 1 годину.',
      },
      {
        step: 'Робочу поверхню злегка підпилити борошном і розкачати тісто до товщини приблизно 7 мм. Вирізати склянкою діаметром 8 см, накрити плівкою і залишити в теплому місці ще на 1 годину.',
      },
      {
        step: 'У каструлю налити рослинну олію, приблизно на 1-2 см, підігріти до 160 ℃ і смажити пончики по одному, з кожного боку приблизно по 30 секунд до золотистого кольору.',
      },
      {
        step: 'Вийняти шумівкою і покласти на паперовий рушник.',
      },
      {
        step: 'Дати трохи охолонути і наповнити будь-якою начинкою.',
      },
    ],
  },
  {
    id: 3,
    name: 'Брауні',
    category: 'Десерт',
    image: './image/brauni.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г.30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '180 г. шоколад темний' },
      { ingredient2: '180 г. масло вершкове' },
      { ingredient3: '75 г. борошна' },
      { ingredient4: '150 г. цукру' },
      { ingredient5: '3 шт. яйця' },
      { ingredient6: '1/4 чайної ложки солі' },
    ],
    description: [
      {
        step1:
          'Масло і шоколад потрібно розтопити, для цього шоколад ламаємо шматочками і кладемо його разом із маслом у ємність, у якій будемо їх розтоплювати. Розтоплюємо шоколад з маслом на водяній бані.',
      },
      {
        step2:
          'Яйця миємо, щоб бруд зі шкаралупи не потрапив у наше тісто, і вибиваємо в ємність для збивання. Туди ж додаємо цукор і сіль.',
      },
      {
        step3:
          'Перемішуємо яйця з сіллю і цукром до однорідного стану і повного розчинення цукру та солі. Не варто занадто старатися, перед нами не стоїть завдання отримати густу пишну піну, потрібно лише перемішати все до однорідності. Тут навіть не обов’язково використовувати міксер, можна перемішувати все звичайним вінчиком або навіть просто виделкою.',
      },
      {
        step4:
          'Додаємо до яєчної маси остиглу шоколадно-масляну суміш, перемішуємо.',
      },
      {
        step5:
          'Просіюємо сюди ж борошно і знову перемішуємо до однорідного стану.',
      },
      {
        step6:
          'Форму для випічки застеляємо пергаментом (я не рекомендую пропускати цей момент, інакше вам буде дуже складно витягувати брауні з форми) і виливаємо в неї наше тісто. Я використовувала форму розміром 22х30см. Шар тіста не повинен бути дуже великим, оптимальна висота тіста у формі має бути близько 2-3 см',
      },
      {
        step7: 'Ставимо форму в розігріту до 175°С духовку на 30-35 хвилин.',
      },
      {
        step8:
          'Щоб брауні вийшли з вологою серединкою, важливо не пропустити час і вчасно витягнути їх із духовки. Тому ближче до кінця випічки, починайте перевіряти готовність зубочисткою. Потрібно зловити момент, коли середина перестала бути рідкою, але на зубочистці все ще залишається трохи вологого тіста (як на фотографії), відразу виймайте форму з духовки, брауні готовий. Важливо не перетримати його, якщо зубочистка виходить сухою, отже, вологої середини у вас уже не вийде.',
      },
      {
        step9:
          'Дайте брауні повністю охолонути, і тільки після цього наріжте на квадрати. Можна також прибрати їх на кілька годин у холодильник, холодні брауні матимуть зовсім іншу текстуру ніж теплі. Теплі брауні більш розсипчасті, більше схожі на вологий щільний бісквіт, а холодні мають більш в’язку і щільну структуру. Тут, звісно, справа смаку, але мені більше подобається брауні, витримані кілька годин у холодильнику.',
      },
    ],
  },
  {
    id: 4,
    name: 'Медове печиво з корицею',
    category: 'Печиво',
    image: './image/pechywo-z-koryceu.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '1.5 стакана борошна' },
      { ingredient: '130 г. цукру' },
      { ingredient: '2 шт. яйця' },
      { ingredient: 'Мед - 2 ст.л.' },
      { ingredient: 'Сода - 0,5 ч.л.' },
      { ingredient: 'Кориця - 1 ст.л. (за смаком)' },
    ],
    description: [
      {
        step: 'Мед підігріти, додати цукор, яйця, соду, перемішати.',
      },
      {
        step: 'Додати корицю.',
      },
      {
        step: 'Додати просіяне борошно. Замісити тісто.',
      },
      {
        step: 'Сформувати кульки (руки можна змочувати водою), викласти на змащений папір на деку. Випікати 15 хв. за 180 ℃.',
      },
    ],
  },
  {
    id: 5,
    name: 'Пиріжки з яблуками в духовці',
    category: 'Десерт',
    image: './image/pyrizhky-z-jablukamy.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 45 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '8/10',
      },
      {
        image: './icon/person.svg',
        info: '10 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '450 г. борошна' },
      { ingredient: '75 г. масло вершкове' },
      { ingredient: '10 г. сухих дріжджів' },
      { ingredient: 'Цукор 6 столових ложок (для тіста і для начинки)' },
      { ingredient: 'Курячі яйця 2 штуки + 1 для змащення пиріжків' },
      { ingredient: 'Молоко 3/4 склянки' },
      { ingredient: 'Свіжі яблука 400 г' },
      { ingredient: 'Щіпка солі' },
    ],
    description: [
      {
        step: 'Спочатку замішуємо легке, повітряне тісто. Для цього потрібно ледь-ледь нагріти молоко і вилити його в каструлю або будь-який інший глибокий посуд. Потім додаємо до молока дріжджі.',
      },
      {
        step: 'Сюди ж додаємо сіль і 2 ложки цукру, розмішуємо, доки дріжджі не розчиняться в молоці разом із цукром.',
      },
      {
        step: 'Тепер у цю суміш додаємо 2 сирих яйця. Трохи-трохи розмішуємо. Також додаємо шматочок розм’якшеного масла.',
      },
      {
        step: 'Далі вводимо поступово в цю масу борошно.',
      },
      {
        step: 'Тісто ми будемо замішувати руками. Воно має вийти дуже ніжним і повітряним, не липнути до рук. Коли тісто вже як слід вимішане, його потрібно скачати у велику кулю, помістити в посуд і закрити зверху щільною серветкою або рушником. Тепер дамо тісту підійти. Залишимо його приблизно на годину, в теплому, без протягів місці,',
      },
      {
        step: 'А поки що зробимо начинку. Яблука добре промиваємо та розрізаємо, звільняємо від серцевин і дрібно ріжемо. Додаємо до яблук 4 ложки цукру і як слід перемішуємо. Щоб яблука не потемніли, збризкуємо їх лимонним соком. Начинка готова!',
      },
      {
        step: 'Тепер, коли тісто настоялося і піднялося, почнемо ліпити пиріжки. Відриваємо від тіста невеликі шматочки, бажано однакові. Кожен шматочок тіста розминаємо руками в коржик. У центр кожного коржика кладемо яблучну начинку, а потім формуємо пиріжки.',
      },
      {
        step: 'Далі застеляємо деко пергаментом і акуратно викладаємо на нього сформовані пиріжки. Зараз нам потрібно дати їм ще трохи підійти. Накриваємо їх серветкою і даємо постояти приблизно 20 хвилин, а потім змащуємо збитим яйцем.',
      },
      {
        step: 'Тепер розігріваємо духовку приблизно до 200 ℃. Випікаємо пиріжки з яблуками в духовці 25 - 30 хвилин.',
      },
    ],
  },
  {
    id: 6,
    name: 'Польський журек',
    category: 'Обід',
    image: './image/zurek-przepis.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г. 30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '2 літри бульйону' },
      { ingredient: '4-5 картоплин' },
      {
        ingredient: '500 мілілітрів закваски житньої',
      },
      { ingredient: '4 копчені ковбаски' },
      { ingredient: '200 г. бекону копченого' },
      { ingredient: '1 велика цибуля' },
      { ingredient: '2 чайні ложки хрону' },
      { ingredient: '1 зубок часнику' },
      { ingredient: 'Сушений майоран' },
      { ingredient: 'Сіль, перець по смаку' },
      { ingredient: '4 варених яєчка' },
    ],
    description: [
      {
        step: 'На сковороді обсмажую нарізаний кубиками бекон, а коли жир почне витоплюватися, додаю нарізану кубиками цибулю і смажу на середньому вогні, поки бекон і цибуля не підрум`яняться до приємного коричневого кольору.',
      },
      {
        step: 'В гарячий бульйон додаю вміст сковорідки, а також порізані ковбаски та варю бульйон на повільному вогні приблизно 30-40 хвилин, доки він не набуде виразного м`ясного смаку та аромату.',
      },
      {
        step: 'До підготовленої таким чином основи додаю закваску (добре перемішану). Для початку лише половину, щоб журек не вийшов надто кислим. За потреби додаю ще закваски, доки не досягну бажаного смаку.',
      },
      {
        step: 'Потім я додаю в каструлю злегка роздавлений зубчик часнику, дві маленькі чайні ложки хрону і, перш за все, майоран. Приблизно одну столову ложку майорану я міцно розтираю в руках, перед додаванням в каструлю, щоб вивільнилося багато аромату.',
      },
      {
        step: 'Перед подачею, очистити яйця, розрізати навпіл та покласти по одному в кожну тарілку.',
      },
      {
        step: 'P.S. Для закваски нам знадобиться: 100 г житнього борошна, 400 мл води, сік ½ лимона. Для закваски висипте у миску 100 г житнього борошна та влийте 400 мл води. Вичавіть сік ½ лимона. Ретельно перемішайте віничком, аби не було грудочок.',
      },
    ],
  },
  {
    id: 7,
    name: 'Тирамісу',
    category: 'Десерт',
    image: './image/tyramisu.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 20 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '10/10',
      },
      {
        image: './icon/person.svg',
        info: '2 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '150 г. цукру' },
      {
        ingredient: '500 г. вершковий сир Маскарпоне',
      },
      { ingredient: '300 мл. міцна кава' },
      { ingredient: '1-2 ст.л. какао-порошок' },
      { ingredient: '6 шт. яйця курячі' },
      { ingredient: '250 г. печиво савоярді' },
      {
        ingredient: '30-50 г. кон’як (за бажанням))',
      },
    ],
    description: [
      {
        step: 'Готуємо всі інгредієнти. Варимо міцний еспресо (300 мл) і залишаємо його остуджуватися.',
      },
      {
        step: 'Яйця (6 шт.) ретельно миємо в теплій воді з милом. Акуратно відокремлюємо білки від жовтків. Важливо, щоб ні краплі жовтка не потрапило в білок, інакше білки не зіб’ються. Білки прибираємо поки що в холодильник, вони знадобляться нам пізніше.',
      },
      {
        step: 'До жовтків додаємо цукор (150 г).',
      },
      {
        step: 'Збиваємо жовтки з цукром, поки маса не побіліє, на це може піти кілька хвилин. Можливо, у вас залишиться трохи нерозчиненого цукру, якщо його не надто багато, то не хвилюйтеся, він розчиниться потім. Якщо цукру залишилося багато, збивайте масу ще.',
      },
      {
        step: 'Викладаємо збиті жовтки з цукром у велику ємність, додаємо туди ж маскарпоне (500 г).',
      },
      {
        step: 'Обережно перемішуємо жовтки з цукром і маскарпоне лопаткою до однорідного стану.',
      },
      {
        step: 'Білки збиваємо з дрібкою солі до стійких піків, на це може піти приблизно 3-7 хвилин, залежно від потужності міксера.',
      },
      {
        step: 'Викладаємо збиті білки в масу з жовтками і маскарпоне. Тепер міксер використовувати не можна, потрібно працювати акуратно, інакше крем може втратити легкість. За допомогою лопатки перемішуємо крем круговими рухами від низу до верху, тобто піднімаємо крем із дна посуду наверх. Не потрібно поспішати, робіть все дуже акуратно, нам потрібно зберегти все повітря, що знаходиться у збитих білках. У нас виходить дуже повітряний і ніжний крем Тірамісу.',
      },
      {
        step: 'Остиглу каву наливаємо в посуд із плоским дном, у який поміщається паличка Савоярді. Невеликий пластиковий контейнер дуже добре тут підійде. Якщо ви робите Тірамісу з коньяком, то додаємо коньяк (30-50 г) у каву.',
      },
      {
        step: 'Кожну паличку Савоярді занурюємо в каву й одразу витягуємо. Я тримала приблизно по 2 секунди, навіть якщо спочатку здається, що печиво залишилося сухе, потім воно просочиться повністю і стане м’яким. Якщо тримати печиво в каві довше, то в результаті в десерті воно виходить досить мокрим.',
      },
      {
        step: 'Просочені кавою палички викладаємо на дно форми. Тут ви можете використати велику форму, а можете взяти маленькі формочки або склянки і робити в них десерти одразу на одну порцію. Мені другий варіант подобається менше, бо тоді весь холодильник буде заставлений купою формочок, зате подавати їх, звісно, простіше. ',
      },
      {
        step: 'Зверху на шар Савоярді викладаємо приблизно половину крему, розрівнюємо.',
      },
      {
        step: 'Зверху крему викладаємо другий шар просоченого кавою печива.',
      },
      {
        step: 'Зверху викладаємо крем, що залишився, вирівнюємо і прибираємо в холодильник на кілька годин, а краще на ніч. Чим довше ви тримаєте Тірамісу в холодильнику, тим краще буде крем тримати форму. Через кілька годин ви ще не зможете дістати з форми акуратний шматочок десерту, зможете лише їсти його ложкою, хоча на смаку це ніяк не позначиться. Уже через 8-10 годин Тірамісу набагато краще триматиме форму і ви вже зможете вирізати гарний шматочок. ',
      },
      {
        step: 'Перед подачею посипте десерт какао.',
      },
    ],
  },
  {
    id: 8,
    name: 'Шоколадне печиво',
    category: 'Печиво',
    image: './image/chokolate-cookies.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 50 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '8 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '150 г. борошна ' },
      { ingredient: '50 г. какао' },
      {
        ingredient: '0,5 ч.л. сіль морська',
      },
      { ingredient: '1 ч.л. розпушувач' },
      { ingredient: '60 г. рослинної олії' },
      { ingredient: '100 г. цукру' },
      { ingredient: '2 шт. яйця' },
      { ingredient: '3-4 ст.л. цукрова пудра' },
    ],
    description: [
      {
        step: 'Змішати борошно з какао, сіллю та розпушувачем.',
      },
      {
        step: 'В окремій мисці збийте цукор з маслом, додайте яйця і ще раз збийте.',
      },
      {
        step: 'Влийте рідку суміш у сухі інгредієнти, розмішайте. Тісто має бути крутим, зберіть його в грудку і приберіть у холодильник на 1 - 2 години.',
      },
      {
        step: 'Потім розкачайте з тіста ковбаску і наріжте на однакові шматочки.',
      },
      {
        step: 'Скачайте кожен шматочок у кульку, щедро обваляйте в цукровій пудрі та викладіть на деко, застелене папером для випічки.',
      },
      {
        step: 'Випікайте в заздалегідь розігрітій до 180° духовці ~ 15 хвилин.',
      },
    ],
  },
  {
    id: 9,
    name: 'Сирна запіканка',
    category: 'Десерт',
    image: './image/syrna-zapikanka.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 50 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '8 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '1 кг. сир ' },
      { ingredient: '80 гр. сметана' },
      {
        ingredient: '1-2 шт. яйця',
      },
      { ingredient: '60 г. манна крупа' },
      { ingredient: '80 г. масло вершкове' },
      { ingredient: '60 г. цукру' },
      { ingredient: 'Ванільний цукор' },
    ],
    description: [
      {
        step: 'Змішати сир з манною кашею та цукром, додаємо яйця, ванільний цукор та розтоплене вершкове масло.',
      },
      {
        step: 'Вирівнюємо запіканку у формі, змащуємо сметаною.',
      },
      {
        step: 'Відправляємо в духовку при 220 ℃ ~ на 30 хвилин, запікаємо до золотистого кольору.',
      },
    ],
  },
  {
    id: 10,
    name: 'Маринована цибуля',
    category: 'Додатки',
    image: './image/marynovana-tsybulya.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '15 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '1/10',
      },
      {
        image: './icon/person.svg',
        info: '1 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '1 цибулина фіолетового кольору' },
      { ingredient: '1 ч. л. цукру ' },
      {
        ingredient: '1 ч. л. солі',
      },
      { ingredient: '1 ст. л. оцту 9%' },
      { ingredient: '10 гілочок кропу ' },
    ],
    description: [
      {
        step: 'Наріжте цибулину півкільцями та перекладіть в глибоку скляну чи емальовану миску.',
      },
      {
        step: 'Залийте окропом, щоб повністю покривав овоч. Це необхідно для того, щоб позбутися зайвої гіркоти. Ми використали 250 мл окропу.',
      },
      {
        step: 'Додайте в цибулю 1 ч. л. цукру, 1 ч. л. солі, 1 ст. л. оцту 9%, перемішайте та залиште на 10 хвилин.',
      },
      {
        step: 'Тим часом помийте 10 гілочок кропу, висушіть паперовим рушником та дрібно посічіть.',
      },
      {
        step: 'Злийте воду з цибулі, використовуючи друшляк, бо зайва рідина нам не потрібна. Перекладіть в глибоку миску, додайте кріп та перемішайте.',
      },
    ],
  },
  {
    id: 11,
    name: 'Дріжджова паска',
    category: 'Десерт',
    image: './image/paska.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г.20 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '8/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '100 г. свіжі дріжджі' },
      { ingredient: '1 л. молоко' },
      {
        ingredient: '0.5 л. сметана',
      },
      { ingredient: '1 кг. цукор' },
      { ingredient: '20 шт. яйця' },
      { ingredient: '700 г. вершкове масло' },
      { ingredient: '3 кг. борошно' },
    ],
    description: [
      {
        step: 'Все з`єднуємо і вимішуємо тісто.',
      },
      {
        step: 'Ставимо в холодильник ночувати.',
      },
      {
        step: 'Змащуємо формочки олією.',
      },
      {
        step: 'Ставимо у розігріту духовку, 180 ℃',
      },
    ],
  },
  {
    id: 12,
    name: 'Сирне Берлінське печиво',
    category: 'Печиво',
    image: './image/videnske-pechyvo.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г.20 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '5 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '250 г. сиру' },
      { ingredient: '250 г. борошна' },
      {
        ingredient: '2 ч.л. розпушувача',
      },
      { ingredient: '200 г. масла' },
    ],
    description: [
      {
        step: 'Сир розтерти блендером.',
      },
      {
        step: 'Все з`єднуємо і вимішуємо тісто.',
      },
      {
        step: 'Відправляємо на 1 годину в холодильник',
      },
      {
        step: 'Потім ділимо на кульки і розкачуємо посипаємо цукром і з обох сторін зкручуємо ковбаску.',
      },
      {
        step: 'Нарізаємо десь по 2 см, приплюскуємо і посипаємо цукром. Випікаємо при 180 градусах.',
      },
    ],
  },
  {
    id: 13,
    name: 'Пісочне горіхове печиво',
    category: 'Печиво',
    image: './image/pisochne_gorichove.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г.30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '100 г. білий шоколад(можна замінити чорним)' },
      { ingredient: '8 г. розпушувач' },
      {
        ingredient: '150 г. горіхи волоські(обсмажені)',
      },
      { ingredient: '150 г. цукор' },
      { ingredient: '2 шт. яйця' },
      { ingredient: '125 г. вершкове масло' },
      { ingredient: '380 г. борошно' },
    ],
    description: [
      {
        step: 'Все з`єднуємо і вимішуємо тісто.',
      },
      {
        step: 'Випікаємо при температурі 180 ℃. від 15 до 18 хвилин.',
      },
    ],
  },
  {
    id: 14,
    name: 'Банановий хліб',
    category: 'Десерт',
    image: './image/chlebek-banana.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г.10 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '3 банани' },
      { ingredient: '10 г. розпушувач' },
      {
        ingredient: '50 г. вершкового масла або оливкової олії',
      },
      { ingredient: '40 г. меленого мигдалю або горіхів' },
      { ingredient: '3 шт. яйця' },
      { ingredient: '150 г. борошно' },
      { ingredient: '2 ст.л. какао' },
      { ingredient: '2 ст.л. меду' },
    ],
    description: [
      {
        step: 'Змішайте всі інгредієнти і вилийте у вистелену папером або силіконову форму для випікання.',
      },
      {
        step: 'Зверху покласти банан, розрізаний уздовж, випікати приблизно 40-45 хвилин при 180 градусах (я випікала без вентилятора), поки паличка не стане сухою - тоді вона буде готова.',
      },
    ],
  },
  {
    id: 15,
    name: 'Вівсяне печиво',
    category: 'Печиво',
    image: './image/vivsianepechyvo.jpg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '50 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '150 г. цукру' },
      { ingredient: '10 г. розпушувач' },
      {
        ingredient: '200 г. вершкового масла',
      },
      { ingredient: '150 г. вівсяні пластівці' },
      { ingredient: '2 шт. яйця' },
      { ingredient: '200 г. борошно' },
    ],
    description: [
      {
        step: 'Збити розм`якшене масло з цукром, додати яйця, збити. Додати пластівці, борошно з розпушувачем і замісити тісто. Дати постояти 15 хвилин',
      },
      {
        step: 'Деко застелити папером для випікання, викласти тісто по 1 ст. л. на відстані 3-4 см. один від одного. Не розмазувати тісто',
      },
      {
        step: 'Випікати в розігрітій до 180 ℃ духовці 15 хв. Дати охолонути',
      },
    ],
  },
  {
    id: 16,
    name: 'Лаваш',
    category: 'Хліб',
    image: './image/tortilla.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '40 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '2/10',
      },
      {
        image: './icon/person.svg',
        info: '8 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '200 г. борошно' },
      { ingredient: '1/2 ч.л. солі' },
      {
        ingredient: '1/2 ч.л. розпушувача',
      },
      { ingredient: '125 мл. теплої води' },
      { ingredient: '3-4 ст.л. олії' },
    ],
    description: [
      {
        step: 'Змішати сухі інгредієнти, додати воду і олію та вимісити протягом декількох хвилин.',
      },
      {
        step: 'Сформуйте 8 або 16 кульок і дайте їм відпочити 15 хвилин.',
      },
      {
        step: 'Тонко розкачайте їх і смажте на сильному вогні по 45 секунд з кожного боку.',
      },
      {
        step: 'Зберігати на кухонному рушнику, щоб зберегти їх м`якими, або коротко розігріти перед використанням.',
      },
    ],
  },
  {
    id: 17,
    name: 'Пельменно-вареникове тісто',
    category: 'Хліб',
    image: './image/pelmeni-varenyky.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '15 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '1/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '450 г. борошно' },
      { ingredient: '1 ч.л. солі' },
      {
        ingredient: '1 куряче яйце',
      },
      { ingredient: '185 мл. теплої води' },
      { ingredient: '1 ст.л. олії' },
    ],
    description: [
      {
        step: 'Яйце збити вилочкою, додати воду, сіль і олію, добре перемішати.',
      },
      {
        step: 'До розчинення солі, всипати борошно порціями, вимісити тісто до "гладкості".',
      },
    ],
  },
  {
    id: 18,
    name: 'Кекси на йогурті',
    category: 'Десерт',
    image: './image/keksy-na-jogurti.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г.10 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '400 г. борошно(у моєму випадку - світлі сорти полби)' },
      { ingredient: '80 г. цукру' },
      {
        ingredient: '3 ч.л. розпушувача',
      },
      { ingredient: '6 шт. яйця' },
      { ingredient: '400 г. натурального йогурту' },
      { ingredient: '40 мл. оливкової олії' },
      { ingredient: '50 г. вершкове масло' },
      { ingredient: '150-200 г. полуниці' },
    ],
    description: [
      {
        step: 'Змішайте сухі інгредієнти в одній мисці, вологі - в іншій (попередньо розтопіть масло і дайте йому охолонути).',
      },
      {
        step: ' Висипте сухі інгредієнти в миску з вологими, акуратно і коротко перемішайте ложкою, щоб з`єднати інгредієнти.',
      },
      {
        step: 'Додайте нарізану полуницю, акуратно перемішайте і викладіть ложкою у формочки для кексів.',
      },
      {
        step: 'Випікайте близько 30 хвилин при 180 градусах догори дном без вогню.',
      },
    ],
  },
  {
    id: 19,
    name: 'Пиріг із лососем і броколі',
    category: 'Вечеря',
    image: './image/losos-cake.jpg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г.10 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '8/10',
      },
      {
        image: './icon/person.svg',
        info: '6 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '200-250 г. борошна' },
      {
        ingredient: '1 ч.л. солі',
      },
      { ingredient: '1 шт. яйцe' },
      { ingredient: '100 г. сметани' },
      { ingredient: '50 г. вершкове масло' },
      { ingredient: '_____________________' },
      { ingredient: '500 г. свіжого лосося (філе)' },
      { ingredient: '300 г. броколі' },
      { ingredient: '_____________________' },
      { ingredient: '200 мл. вершків 10-20%' },
      { ingredient: '100 г. сиру' },
      { ingredient: '2 шт. яйця' },
      { ingredient: 'Сіль' },
      { ingredient: 'Перець' },
    ],
    description: [
      {
        step: 'Масло змішати з яйцем, додати сметану.',
      },
      {
        step: 'Додати сіль і борошно, замісити тісто.',
      },
      {
        step: 'Форму (я використовую форму діаметром 26 см) трохи змастити олією. Викласти тісто, зробити бортики.',
      },
      {
        step: 'Рибу нарізати невеликими шматочками.',
      },
      {
        step: 'Готуємо заливку: Сир натерти на дрібній тертці, яйця трохи збити, посолити, поперчити додати вершки, перемішати. Додати сир, перемішати.',
      },
      {
        step: 'На тісто викласти рибу та броколі, трохи посолити, поперчити.',
      },
      {
        step: 'Вилити заливку. Поставити в розігріту до 180 градусів духовку. Випікати протягом 40-45 хвилин.',
      },
    ],
  },
  {
    id: 20,
    name: 'Полуничне морозиво',
    category: 'Десерт',
    image: './image/strawberry-icecream.webp',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '8г.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '12 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '130 г. молоко' },
      { ingredient: '150 г. цукру' },
      {
        ingredient: '400 г. полуниця',
      },
      { ingredient: '500 г. вершки' },
      { ingredient: '3 жовтки' },
    ],
    description: [
      {
        step: 'Спочатку займемося приготуванням заварної основи для домашнього полуничного морозива. Для цього у відповідний посуд кладемо три яєчні жовтки. Додаємо цукор і збиваємо вінчиком або міксером близько 30 секунд, щоб вийшла гладка й однорідна маса. Наливаємо до жовтків із цукром молоко. Ще раз усе дуже ретельно перемішуємо.',
      },
      {
        step: 'Ставимо посуд з отриманою масою на водяну баню. Це означає, що в іншій каструлі доводимо до кипіння склянку води. Ставимо всю цю споруду на вогонь і, постійно помішуючи, варимо жовтки, цукор і молоко на повільному вогні до загустіння маси - 10 хвилин достатньо. Тільки не переваріть, інакше вийде омлет, а нам потрібен повністю гладкий заварний крем. Щойно відчуєте, що маса почала густіти, одразу знімайте з водяної бані.',
      },
      {
        step: 'За консистенцією гарячий заварний виходить схожим на згущене молоко. Даємо йому повністю охолонути. Для прискорення процесу охолодження можна помістити каструльку в тазик із крижаною водою і помішувати суміш.',
      },
      {
        step: 'Свіжу полуницю ретельно миємо. Для цього набираємо у велику ємність холодну воду, кладемо в неї ягоди і даємо їм буквально хвилинку поплавати. Акуратно перемішуємо їх руками, після чого виймаємо і перекладаємо на друшляк. Важливо не видаляти хвостики до того моменту, поки ягоди не будуть чистими. В іншому разі полуниця вбере в себе велику кількість води, а зайва волога в морозиві ні до чого. Після цього даємо ягодам повністю обсохнути - перекладіть полуницю на рушник. Відриваємо хвостики і складаємо обсушені ягоди в посуд, у якому збираєтеся їх подрібнювати. Протираємо полуницю через сито, щоб позбутися кісточок. Протерта полуничка без кісточок виходить як рідкувате ягідне пюре.',
      },
      {
        step: 'З`єднуємо ягідну масу із заварною основою, яка вже встигла повністю охолонути.',
      },
      {
        step: 'Перемішуємо все до однорідності ложкою, лопаткою, вінчиком або за допомогою міксера.',
      },
      {
        step: 'Після цього потрібно збити холодні жирні вершки до пишності, щоб вони вийшли як крем. Не перебийте, інакше в результаті отримаєте масло і сироватку.',
      },
      {
        step: 'В охолоджений заварний крем із полуничним пюре вводимо збиті вершки. Вінчиком або на найнижчих обертах міксером з`єднуємо все до однорідності. Недовго, просто щоб усе стало гладким. Це наша заготовка для домашнього полуничного морозива. Вона вже надзвичайно смачна, але ми ж хочемо морозиво, тому основу потрібно заморозити.',
      },
      {
        step: 'Перекладаємо майбутній десерт у відповідний для заморозки посуд, який закриваємо кришкою і ставимо в морозилку.',
      },
      {
        step: 'Бажано кожні 30 хвилин діставати і ретельно перемішувати морозиво, щоб потім у ньому не було кристаликів льоду. І так хоча б рази 4-5. Через чотири-п`ять годин заморожування перемішувати масу не треба. Що частіше й активніше ви будете перемішувати вміст посуду, то менша ймовірність, що в готовому морозиві будуть кристалики льоду.',
      },
      {
        step: 'Домашнє полуничне морозиво готове. Балуємо себе та коханих смачними домашніми ласощами!',
      },
    ],
  },
  {
    id: 21,
    name: 'Медовик ледачий',
    category: 'Десерт',
    image: './image/medovyk.webp',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '150 г. вершкового масла' },
      { ingredient: '100 г. меду' },
      {
        ingredient: '80 г. цукру',
      },
      { ingredient: '300 г. (+/-) пшеничного борошна' },
      { ingredient: '2 шт. яйця' },
      { ingredient: '1 ч.л. соди' },
      { ingredient: 'Щіпка солі' },
      { ingredient: '_____________________' },
      { ingredient: '650 г. сметани (25% і вище)' },
      { ingredient: '70 г. цукрової пудри' },
      { ingredient: '80 гр. меду' },
    ],
    description: [
      {
        step: 'Змішуємо мед, вершкове масло і цукор. Ставимо на маленький вогонь та помішуємо, доводимо до кипіння. Після закипання додаємо соду, перемішуємо. Даємо охолонути.',
      },
      {
        step: 'Після охолодження додаємо сіль, та яйця, добре вбиваючи кожне.',
      },
      {
        step: 'Всипаємо борошно і замішуємо в`язке, густе тісто',
      },
      {
        step: 'Ділимо тісто на дві частини, деко застеляємо силіконовим килимком або пергаментом. Розрівнюємо тісто лопаткою рівномірно по всій поверхні.',
      },
      {
        step: 'Ставимо в духовку на 180 градусів, час випікання приблизно 6-7 хвилин.',
      },
      {
        step: 'Після випікання, одразу підрівнюємо краї та ділимо корж на 4 частини.',
      },
      {
        step: 'Змішуємо сметану, мед та цукрову пудру, ретельно вимішуємо.',
      },
      {
        step: 'Перемазуємо коржі кремом, та посипаємо крихтами від коржів.',
      },
      {
        step: 'Відправляємо торт до холодильника на 4 години, а краще на ніч.',
      },
    ],
  },
  {
    id: 22,
    name: 'Гофри',
    category: 'Десерт',
    image: './image/gofry.webp',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '100 мл. рослинної олії' },
      { ingredient: '280 мл. Молока' },
      {
        ingredient: '15-40 г. цукру',
      },
      { ingredient: '300 г. борошна' },
      { ingredient: '2 шт. яйця' },
      { ingredient: '10 г. розпушувача' },
      { ingredient: 'Щіпка солі' },
    ],
    description: [
      {
        step: 'Яйця збиваємо вінчиком до повітряної піни. Не перестаючи збивати, додаємо інші інгредієнти.',
      },
      {
        step: 'Для кращого ефекту заздалегідь змішайте борошно і розпушувач.',
      },
      {
        step: 'Перемішуємо суміш до однорідності та випікаємо вафлі 3,5 - 4 хвилини в добре розігрітій вафельниці.',
      },
    ],
  },
  {
    id: 23,
    name: 'Кекси 12 ложок',
    category: 'Десерт',
    image: './image/keksyFast.webp',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '5/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '12 ст.л. молока' },
      { ingredient: '12 ст.л. рослинної олії' },
      {
        ingredient: '12 ст.л. цукру',
      },
      {
        ingredient: '12 ст.л. борошна',
      },
      { ingredient: 'Ваніль' },
      { ingredient: '3 шт. яйця' },
      { ingredient: '7 г. розпушувача' },
      { ingredient: 'Щіпка солі' },
    ],
    description: [
      {
        step: 'Яйця збиваємо із сіллю, цукром і ваніллю. Додаємо молоко та масло. Борошно та розпушувач.',
      },
      {
        step: 'Випікаємо при 180°С до готовності хвилин 30-40 хв.',
      },
    ],
  },
  {
    id: 24,
    name: 'Свинні реберця',
    category: 'Вечеря',
    image: './image/rebra_pork.webp',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '3г.',
      },
      {
        image: './icon/difficulty.svg',
        info: '3/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient: '1.0 кг Свинні ребра' },
      { ingredient: '2 ст.л. меду' },
      {
        ingredient: '2 ст.л. Соняшникова олія ',
      },
      {
        ingredient: '1 ст.л. Гірчиця',
      },
      { ingredient: '1 ч.л. Чорний перець' },
      { ingredient: '1 ч.л. Часник сухий' },
      { ingredient: '1 ч.л. Сіль' },
      { ingredient: '5 ст.л. Соєвий соус' },
    ],
    description: [
      {
        step: 'Знімаємо плівку з внутрішньої сторони ребер.',
      },
      {
        step: 'Робимо надрізи між кістками, для кращого вбирання маринаду.',
      },
      {
        step: 'Вимішуємо всі спеції, перець, часник, сіль, гірчицю та мед.',
      },
      {
        step: 'Додаємо олію, та соєвий соус. Додаємо мед, та ретельно перемішуємо.',
      },
      {
        step: 'Змішуємо наші реберця в маринаді. Залишаємо мінімум на 3 години, за можливості краще залишити на ніч.',
      },
      {
        step: 'Викладаємо ребра на пергаментний папір, загортаємо, та зверху загортаємо фольгою. Кістками донизу.',
      },
      {
        step: 'Ставимо в розігріту духовку, на 180 градусів. Запікаємо 2 години.',
      },
      {
        step: 'Дістаємо реберця, змазуємо залишковим маринадом, та ставимо на 15-20 хвилин, не загортаючи.',
      },
    ],
  },
];
