export const recipes = [
  {
    id: 1,
    name: 'Пампушки',
    category: 'Обід',
    image: './image/pampushki-s.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 40 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '450 г. пшеничного борошна', id: 0 },
      { ingredient2: '10 г. сухих дріжджів', id: 1 },
      { ingredient3: '250 мл. теплого молока', id: 2 },
      { ingredient4: '1 ст. л. цукру', id: 3 },
      { ingredient5: '½ ч. л. солі', id: 4 },
      { ingredient6: '3 зубчики часнику', id: 5 },
      { ingredient7: '6 гілочок кропу', id: 6 },
      { ingredient8: '2 ст. л. соняшникової олії', id: 7 },
      { ingredient9: 'Сіль та перець до смаку', id: 8 },
      {
        ingredient11:
          '100 г розм’якшеного вершкового масла або соняшникової олії (+ для змащування форми)',
      },
    ],
    description: [
      {
        step1:
          'У великій мисці змішайте спочатку сухі інгредієнти для тіста: 450 г пшеничного борошна, 10 г сухих дріжджів, 1 ст. л. цукру і ½ ч. л. солі. Цукор всипайте в інший бік миски від дріжджів. Потім влийте 250 мл теплого молока, додайте 100 г розм’якшеного вершкового масла.',
      },
      {
        step2:
          'Замісіть еластичне тісто, воно не повинно прилипати до рук. Залиште його в теплому місці на 45 хвилин, накривши рушником або харчовою плівкою. Потім обімніть тісто і розділіть на 12 кульок, сформуйте пампушки. Розігрійте духовку до 180 градусів.',
      },
      {
        step3:
          'Акуратно розкладіть пампушки у форму, попередньо змащену вершковим маслом чи олією. Залиште пампушки у формі ще на 30 хвилин. Ми використовували прямокутну форму розміром приблизно 28х16 см, але можна взяти круглу чи будь-яку іншу, тут це не має великого значення.',
      },
      {
        step4:
          'Поставте форму з пампушками, що підійшли, у розігріту до 180 градусів духовку випікатися на 25-30 хвилин.',
      },
      {
        step5:
          'Тим часом зробіть начинку. Очистіть 3 зубчики часнику і дуже дрібно порубайте ножем. Викладіть у маленьку піалу. Помийте й обсушіть зелень 6 гілочок кропу і теж дрібно посічіть. З’єднайте з часником. Додайте 2 ст. л. соняшникової олії, 1 ст. л. оцту і сіль з перцем до смаку. Ретельно перемішайте.',
      },
      {
        step6:
          'Щедро полийте часниковою заправкою готові пампушки, поки ще гарячі, так вони краще наситяться ароматами.',
      },
    ],
  },
  {
    id: 2,
    name: 'Пончики',
    category: 'Десерт',
    image: './image/ponchyky.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г. 30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '7/10',
      },
      {
        image: './icon/person.svg',
        info: '3 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '4 г. сухих дріжджів' },
      { ingredient2: '6 г. солі' },
      { ingredient3: '40 г. кефіру ' },
      { ingredient4: '80 г. води' },
      { ingredient5: '80 г. яєчних жовтків' },
      { ingredient6: '30 г. цукру' },
      { ingredient7: '50 г. вершкового масла' },
      { ingredient8: '310 г. борошна' },
    ],
    description: [
      {
        step1:
          'У чаші міксера змішати кефір, воду, жовтки, борошно і дріжджі. Перемішати насадкою "гак" на низькій швидкості (3 хв.)',
      },
      {
        step2:
          'Додати сіль і цукор, перемішати ще 1 хвилину і додати нарізане кубиками холодне масло. Замішувати поки тісто не почне відлипати від стінок чаші (10-15 хвилин). Воно в результаті має бути гладким і блискучим.',
      },
      {
        step3:
          'Сформувати з тіста кулю, покласти в чисту чашу, накрити плівкою або рушником і залишити в теплому місці на 1 годину.',
      },
      {
        step4:
          'Робочу поверхню злегка підпилити борошном і розкачати тісто до товщини приблизно 7 мм. Вирізати склянкою діаметром 8 см, накрити плівкою і залишити в теплому місці ще на 1 годину.',
      },
      {
        step5:
          'У каструлю налити рослинну олію, приблизно на 1-2 см, підігріти до 160 ℃ і смажити пончики по одному, з кожного боку приблизно по 30 секунд до золотистого кольору.',
      },
      {
        step6: 'Вийняти шумівкою і покласти на паперовий рушник.',
      },
      {
        step7: 'Дати трохи охолонути і наповнити будь-якою начинкою.',
      },
    ],
  },
  {
    id: 6,
    name: 'Польський журек',
    category: 'Обід',
    image: './image/zurek-przepis.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '2г. 30 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '2 літри бульйону' },
      { ingredient2: '4-5 картоплин' },
      {
        ingredient3: '500 мілілітрів закваски житньої',
      },
      { ingredient4: '4 копчені ковбаски' },
      { ingredient5: '200 г. бекону копченого' },
      { ingredient6: '1 велика цибуля' },
      { ingredient7: '2 чайні ложки хрону' },
      { ingredient8: '1 зубок часнику' },
      { ingredient9: 'Сушений майоран' },
      { ingredient10: 'Сіль, перець по смаку' },
      { ingredient11: '4 варених яєчка' },
    ],
    description: [
      {
        step1:
          'На сковороді обсмажую нарізаний кубиками бекон, а коли жир почне витоплюватися, додаю нарізану кубиками цибулю і смажу на середньому вогні, поки бекон і цибуля не підрум`яняться до приємного коричневого кольору.',
      },
      {
        step2:
          'В гарячий бульйон додаю вміст сковорідки, а також порізані ковбаски та варю бульйон на повільному вогні приблизно 30-40 хвилин, доки він не набуде виразного м`ясного смаку та аромату.',
      },
      {
        step3:
          'До підготовленої таким чином основи додаю закваску (добре перемішану). Для початку лише половину, щоб журек не вийшов надто кислим. За потреби додаю ще закваски, доки не досягну бажаного смаку.',
      },
      {
        step4:
          'Потім я додаю в каструлю злегка роздавлений зубчик часнику, дві маленькі чайні ложки хрону і, перш за все, майоран. Приблизно одну столову ложку майорану я міцно розтираю в руках, перед додаванням в каструлю, щоб вивільнилося багато аромату.',
      },
      {
        step5:
          'Перед подачею, очистити яйця, розрізати навпіл та покласти по одному в кожну тарілку.',
      },
      {
        step6:
          'P.S. Для закваски нам знадобиться: 100 г житнього борошна, 400 мл води, сік ½ лимона. Для закваски висипте у миску 100 г житнього борошна та влийте 400 мл води. Вичавіть сік ½ лимона. Ретельно перемішайте віничком, аби не було грудочок.',
      },
    ],
  },
]
