export const recipes = [
  {
    id: 1,
    name: 'Пампушки',
    category: 'Обід',
    image: './image/pampushki-s.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '40 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '4/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '450 г. пшеничного борошна' },
      { ingredient2: 'Яйця' },
      { ingredient3: '10 г сухих дріжджів' },
      { ingredient4: '250 мл. теплого молока' },
      { ingredient5: '1 ст. л. цукру' },
      { ingredient6: '½ ч. л. солі' },
      { ingredient7: '3 зубчики часнику' },
      { ingredient8: '6 гілочок кропу' },
      { ingredient9: '2 ст. л. соняшникової олії' },
      { ingredient10: 'Сіль та перець до смаку' },
      {
        ingredient11:
          '100 г розм’якшеного вершкового масла або соняшникової олії (+ для змащування форми)',
      },
    ],
    description: [
      {
        step1:
          'У великій мисці змішайте спочатку сухі інгредієнти для тіста: 450 г пшеничного борошна, 10 г сухих дріжджів, 1 ст. л. цукру і ½ ч. л. солі. Цукор всипайте в інший бік миски від дріжджів. Потім влийте 250 мл теплого молока, додайте 100 г розм’якшеного вершкового масла.',
      },
      {
        step2:
          'Замісіть еластичне тісто, воно не повинно прилипати до рук. Залиште його в теплому місці на 45 хвилин, накривши рушником або харчовою плівкою. Потім обімніть тісто і розділіть на 12 кульок, сформуйте пампушки. Розігрійте духовку до 180 градусів.',
      },
      {
        step3:
          'Акуратно розкладіть пампушки у форму, попередньо змащену вершковим маслом чи олією. Залиште пампушки у формі ще на 30 хвилин. Ми використовували прямокутну форму розміром приблизно 28х16 см, але можна взяти круглу чи будь-яку іншу, тут це не має великого значення.',
      },
      {
        step4:
          'Поставте форму з пампушками, що підійшли, у розігріту до 180 градусів духовку випікатися на 25-30 хвилин.',
      },
      {
        step5:
          'Тим часом зробіть начинку. Очистіть 3 зубчики часнику і дуже дрібно порубайте ножем. Викладіть у маленьку піалу. Помийте й обсушіть зелень 6 гілочок кропу і теж дрібно посічіть. З’єднайте з часником. Додайте 2 ст. л. соняшникової олії, 1 ст. л. оцту і сіль з перцем до смаку. Ретельно перемішайте.',
      },
      {
        step6:
          'Щедро полийте часниковою заправкою готові пампушки, поки ще гарячі, так вони краще наситяться ароматами.',
      },
    ],
  },
  {
    id: 2,
    name: 'Сирники',
    category: 'Сніданок',
    image: './image/syrnyky.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '17 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '2/10',
      },
      {
        image: './icon/person.svg',
        info: '2 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '400 г Сир (Творог) (9 % жирності)' },
      { ingredient2: '1 шт. Яйце' },
      { ingredient3: '3 ст. л. Борошно (і додатково для паніровки)' },
      { ingredient4: '3 ст. л. Цукор' },
      { ingredient5: '3-4 ст. л. Соняшникова олія для смаження' },
      { ingredient6: '1 дрібка Сіль' },
      { ingredient7: '10 г Ванільний цукор' },
    ],
    description: [
      {
        step1:
          'Сир (400 г) перекладіть в невелику скляну або пластикову миску. Додайте дрібку солі, одне яйце, 3 ст. л. цукру, і 10 г ванільного цукру. Я не люблю, щоб сирники були занадто солодкими, але ви можете додати трохи більше цукру, наприклад 4 ст. л. Сир для сирників можна використовувати як базарний, так і магазинний. Головне, щоб він був не кислим і не сильно вологим. Якщо використовуєте магазинний сир, то беріть сир в м’яких поліетиленових пакетах.',
      },
      {
        step2:
          'Після того, як ви покладете всі інгредієнти до миски, перемішайте їх до отримання однорідної маси. Для цього найкраще використовувати звичайну виделку, ложку або товкучку для картоплі.',
      },
      {
        step3:
          'До отриманої сирної суміші додайте 3 ст. л. пшеничного борошна. Якщо сир виявився досить мокрим, то додайте на одну столову ложку борошна більше. Але головне не переборщити, щоб сирники вийшли ніжними.',
      },
      {
        step4:
          'Змочіть руки невеликою кількістю соняшникової олії і скачайте з сирної маси невеликі кульки діаметром 3-4 см. Придавіть кульки руками, щоб вийшли гарні невеликі сирники.',
      },
      {
        step5:
          'Тепер запаніруйте сирники в борошні, щоб вони не втратили форму і засмажити до апетитною скоринки.',
      },
      {
        step6:
          'Розігрійте антипригарну пательню з 3-4 ст. л. соняшникової олії на середньому вогні. Пательня для сирників повинна добре розігрітися. Не зменшуйте вогонь при смаженні, так ваші сирники підсмажаться якнайкраще. Слідкуйте, щоб сирники не пригоріли. Для того, щоб отримати красиву золотисту скориночку я обсмажував сирники по 2-3 хвилини з кожного боку. Але у вас може піти трохи більше або менше часу.',
      },
      {
        step7:
          'Щоб видалити зайву олію з готових сирників, перекладіть їх спочатку на паперовий рушник. Потім перекладіть сирники в тарілки для подачі, посипте трохи цукровою пудрою, додайте варення або сметану.',
      },
    ],
  },
  {
    id: 3,
    name: 'Борщ',
    category: 'Обід',
    image: './image/borsh.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 15 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '7/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '2 л води' },
      { ingredient2: '3-4 картоплі' },
      { ingredient3: '2 буряки' },
      { ingredient4: '1 цибуля ріпчаста' },
      { ingredient5: '200 г квашеної капусти (з розсолом)' },
      { ingredient6: '½ моркви' },
      { ingredient7: '½ болгарського перцю' },
      { ingredient8: '1-2 ст. л. меду' },
      { ingredient9: '2 ст. л. томатної пасти' },
      { ingredient10: 'солі та перцю — на смак' },
    ],
    description: [
      {
        step1:
          'Спершу приготуйте відвар з двох буряків. Почистьте та розріжте навпіл коренеплід. Залийте його водою та відваріть 40 хв до готовності. Після продовжуйте варити далі, додавши ½ цибулини.',
      },
      {
        step2:
          'Наріжте 3-4 картоплини кубиками та пів моркви соломкою. Варіть їх разом з буряком.',
      },
      {
        step3:
          'Зробіть засмажку. Наріжте кубиками пів болгарського перцю та другу половину цибулі. Обсмажте 3-5 хвилин з невеликою кількістю рослинної олії. Додайте 2 ст. л. томатної пасти й протушкуйте ще 2-3 хвилини.',
      },
      {
        step4:
          'Дайте відвареному буряку охолонути та наріжте довільно. А потім — разом з засмажкою відправте назад у відвар.',
      },
      {
        step5:
          'Коли всі овочі приготуються, додайте квашену капусту з 200 г розсолу. Проваріть 2-3 хвилини й додайте сіль, перець та 1-2 ст.л. меду.',
      },
      {
        step6:
          'Залиште настоюватися готовий борщ 15-20 хвилин або ж помістіть на цей час у духовку на 180 градусів.',
      },
    ],
  },
  {
    id: 4,
    name: 'Вареники з полуницею',
    category: 'Десерт',
    image: './image/varenyky-z-polynuceu.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '40 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '6/10',
      },
      {
        image: './icon/person.svg',
        info: '4 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '400 г борошна' },
      { ingredient2: '200 мл окропу' },
      { ingredient3: '3 ст. л. олії' },
      { ingredient4: '1 дрібка солі' },
      { ingredient5: '400 г полуниці' },
      { ingredient6: 'мед для подачі' },
    ],
    description: [
      {
        step1:
          'Підготуйте всі інгредієнти для приготування смачних та соковитих вареників з полуницею. Ягоди ретельно помийте, очистіть від хвостиків. Розріжте ягоди навпіл. Якщо полуниця дуже велика, можна порізати на 4 частини.',
      },
      {
        step2:
          'Для тіста висипте у миску 400 г борошна та залийте 200 мл окропу. Далі влийте 3 ст. л. олії та всипте 1 дрібку солі.',
      },
      {
        step3:
          'Вимішуйте тісто спочатку ложкою, а потім руками. В результаті у вас має вийти еластичне тісто, яке не липне до рук.',
      },
      {
        step4:
          'Розкачайте тісто у тонкий пласт товщиною приблизно 2 мм. Виріжте кружечки склянкою або будь-яким іншим посудом чи спеціальною формочкою.',
      },
      {
        step5:
          'У кожен кружечок тіста викладайте часточку полуниці та заліплюйте краї. Робіть по краях вареничків візерунки, як вам більше до вподоби.',
      },
      {
        step6:
          'Закип’ятіть воду у великій каструлі. Вкидайте вареники та варіть 5 хвилин після спливання. Діставайте шумівкою та подавайте із медом, цукром чи цукровою пудрою.',
      },
    ],
  },
  {
    id: 5,
    name: 'Лазанья',
    category: 'Вечеря',
    image: './image/lazania_sitewebukrnew.jpeg',
    iconInfo: [
      {
        image: './icon/time.svg',
        info: '1г. 20 хв.',
      },
      {
        image: './icon/difficulty.svg',
        info: '8/10',
      },
      {
        image: './icon/person.svg',
        info: '8 о.',
      },
    ],
    srcIngredient: [
      { ingredient1: '800-900 г телячого фаршу (або асорті)' },
      {
        ingredient2: '1 склянка томатного соку (або томатного соусу до смаку)',
      },
      { ingredient3: '3 ст. л. оливкової олії' },
      { ingredient4: '1 ріпчаста цибуля' },
      { ingredient5: '3 зубчики часнику' },
      { ingredient6: '2 стебла селери' },
      { ingredient7: '100 мл червоного сухого вина' },
      { ingredient8: '300 г твердого сиру' },
      { ingredient9: '70 г пармезану' },
      { ingredient10: '15-16 листів лазаньї' },
      { ingredient11: '3 гілочки базиліка для подачі (за бажанням)' },
      { ingredient12: 'до смаку сіль і перець' },
      { ingredient13: '800 мл-1 л молока' },
      {
        ingredient14: '80-100 г вершкового масла (+20 г для змащування форми)',
      },
      { ingredient15: '80-100 г борошна' },
      { ingredient16: '¼ ч. л. меленого мускатного горіха (чи натертого)' },
      { ingredient17: '1-2 дрібки солі' },
    ],
    description: [
      {
        step1:
          'Спершу приготуйте відвар з двох буряків. Почистьте та розріжте навпіл коренеплід. Залийте його водою та відваріть 40 хв до готовності. Після продовжуйте варити далі, додавши ½ цибулини.',
      },
      {
        step2:
          'Наріжте 3-4 картоплини кубиками та пів моркви соломкою. Варіть їх разом з буряком.',
      },
      {
        step3:
          'Зробіть засмажку. Наріжте кубиками пів болгарського перцю та другу половину цибулі. Обсмажте 3-5 хвилин з невеликою кількістю рослинної олії. Додайте 2 ст. л. томатної пасти й протушкуйте ще 2-3 хвилини.',
      },
      {
        step4:
          'Дайте відвареному буряку охолонути та наріжте довільно. А потім — разом з засмажкою відправте назад у відвар.',
      },
      {
        step5:
          'Коли всі овочі приготуються, додайте квашену капусту з 200 г розсолу. Проваріть 2-3 хвилини й додайте сіль, перець та 1-2 ст.л. меду.',
      },
      {
        step6:
          'Залиште настоюватися готовий борщ 15-20 хвилин або ж помістіть на цей час у духовку на 180 градусів.',
      },
    ],
  },
]
